In [ ]:
import pandas as pd

In [17]:
df_text = pd.read_table('/media/ermak/94B2DAA4B2DA8A5E/computer-graphics-sem4/lab_01/test.txt',sep=' ')

In [18]:
df_text

   x  y
0  1  2
1  3  4
2  5  6
3  7  8
4  3  4
5  5  6

In [19]:

df_text = df_text.loc[df_text.index != 4]

In [20]:
df_text

   x  y
0  1  2
1  3  4
2  5  6
3  7  8
5  5  6

In [22]:
df_text.loc['3'] = "NaN"

In [23]:
df_text

     x    y
0    1    2
1    3    4
2    5    6
3  NaN  NaN
5    5    6
3  NaN  NaN

In [31]:
df_text.dropna(how='all')

     x    y
0    1    2
1    3    4
2    5    6
3  NaN  NaN
5    5    6
3  NaN  NaN

In [32]:
df_text

     x    y
0    1    2
1    3    4
2    5    6
3  NaN  NaN
5    5    6
3  NaN  NaN